package com.bistu.common.util.constants;

/**
 * @author: SJJ
 * @date: 2022/6/16
 */
public enum ErrorEnum {
	/*
	 * 错误信息
	 * */
	E_400("400", "请求处理异常，请稍后再试"),
	E_401("401", "请勿重复请求"),
	E_402("402", "请求签名校验错误"),
	E_500("500", "请求方式有误,请检查 GET/POST"),
	E_501("501", "请求路径不存在"),
	E_502("502", "权限不足"),
	//    E_502("502", "权限不足"),
	E_601("601", "无授权"),
	E_10008("10008", "角色删除失败,尚有用户属于此角色"),
	E_10009("10009", "账户已存在"),
	E_10010("10010", "账号/密码错误"),

	E_20011("20011", "登陆已过期,请重新登陆"),
	E_20012("20012", "文件已过期，请重新上传，操作"),
	E_20013("20013", "已抵达最大处理文档数，请联系售后人员提高限额"),

	E_20014("20014", "关闭文档失败"),
	E_20015("20015", "预览链接已过期"),
	E_20016("20016", "秘钥初始化失败"),
	E_20017("20017", "FeignClient访问失败"),
	E_20018("20018", "文件上传失败，文档大小超出限制"),
	E_20019("20019", "配置保存失败"),
	E_20020("20020", "后台登录失败"),

	E_80001("80001", "文件打开失败"),
	E_80002("80002", "请打开格式为ofd或pdf的文件"),

	// hyjnew 2023.7.31 加密pfd部分
	E_80005("80005", "加密PDF"),
	E_80006("80006", "打开文档格式损坏,无法打开"),
	E_80007("80007", "输入密码错误"),
	// hyj-0818-add 签章部分错误码
	E_80008("80008", "当前仅支持对ofd文档盖章"),
	E_80009("80009", "获取页面大小失败"),
	E_80010("80010", "文件复制失败"),
	E_80011("80011", "路径为空"),
	// 元数据部分错误码
	E_80012("80012", "仅支持OFD文件打开文档属性"),
	E_80013("80013", "分享失败"),


	// zxh-0714-add:添加注释相关错误码
	E_80014("80014", "注释获取失败"),
	E_80015("80015", "注释添加失败"),
	E_80016("80016", "注释删除失败"),
	E_80017("80017", "注释移动失败"),
	E_80018("80018", "注释回复信息设置失败"),
	E_80019("80019", "注释隐藏失败"),

	// zxh-0717-add:文件保存相关错误码
	E_80030("80030", "文件保存失败"),
	E_80031("80031", "文件另存为失败"),
	E_80032("80032", "上传文件为空或大小为0"),

	// bookMarkErrorCode,wx_add
	E_80021("80021", "请求书签不存在"),
	E_80022("80022", "书签名不能为空"),
	E_80023("80023", "书签解析失败"),
	E_80024("80024", "请求页码不对，请检查"),
	E_80025("80025", "操作失败，内核出错"),
	E_80026("80026", "注释不存在"),

	// printErrorCode
	// 2023.7.27 lyh add: 打印相关错误码
	E_80040("80040", "输入的页码过大"),
	E_80041("80041", "请输入一个有效的打印范围"),
	E_80042("80042", "内核打印出错"),
	E_80043("80043", "中断打印"),

	// JNIController: 20240416 ll add
	E_80051("80051", "获取页面图片失败"),
	E_80052("80052", "获取页面图片失败"),
	E_80053("80053", "获取大纲失败"),
	E_80054("80054", "获取书签失败"),
	E_80055("80055", "获取元数据失败"),
	E_80056("80056", "修改元数据失败"),

	E_80061("80061", "获取页面文字失败"),
	E_80062("80062", "获取区域文字范围失败"),
	E_80063("80063", "搜索文字失败"),
	E_80064("80064", "获取签章数据失败"),
	E_80065("80065", "获取签章信息失败"),

	E_80071("80071", "获取附件失败"),
	E_80072("80072", "添加附件失败"),
	E_80073("80073", "XBRL解析失败，文件不符合xbrl标准"),

	E_80080("80080", "盖章失败"),
	E_80081("80081", "验章失败"),
	E_80082("80082", "删除印章失败"),

	// TagsErrorCode: 80100--80150 07.14-ts-add: 新增语义树的错误码
	E_80100("80100", "请求文件不存在"),
	E_80101("80101", "语义树导出失败"),
	E_80102("80102", "语义树导入失败"),
	E_80103("80103", "语义树删除失败"),
	E_80104("80104", "添加子节点失败"),
	E_80105("80105", "向前添加同级节点失败"),
	E_80106("80106", "向后添加同级节点失败"),
	E_80107("80107", "尾加节点失败"),
	E_80108("80108", "关联失败"),
	E_80109("80109", "语义树节点删除失败"),
	E_80110("80110", "获取语义树信息失败"),
	E_80111("80111", "获取是否有语义树失败"),
	E_80112("80112", "关联区域未包含文字，请重新关联"),

	// openFileErrorCode
	E_80120("80120", "文档创建指针失败"),
	E_80121("80121", "ctor失败"),
	E_80122("80122", "opendoc失败"),
	E_80123("80123", "设置setPrintParamByXMl失败"),
	E_80124("80124", "printPage失败"),
	E_80125("80125", "输出文件图片为空"),

	// MultiDocErrorCode: 80151--80199 09.20-ts-add: 新增多文档的错误码
	E_80151("80151", "多文档信息获取失败"),
	// ---------------------------------------------------------------------
	E_90003("90003", "缺少必填参数"),
	E_80200("80200", "上传文件为空或url为空"),
	E_80201("80201", "自定义尺寸不合法"),
	E_80202("80202", "html转换失败"),

	// xDesigner
	E_70001("70001", "OFD生成失败"),

	// xMaker相关
	E_60001("60001", "文件上传失败"),
	E_60002("60002", "请上传OFD格式文件"),
	E_60003("60003", "传参出错"),
	E_60004("60004", "上传文件已过期，请重新上传"),
	E_60005("60005", "文档合并失败"),
	E_60006("60006", "文档拆分失败"),
	E_60007("60007", "OFD文档页数获取失败"),
	E_60008("60008", "OFD文档解析失败"),
	E_60009("60009", "OFD文档页面编辑失败"),
	E_60010("60010", "上传的文档不在有效期内"),
	E_60011("60011", "文档转换失败"),
	E_60012("60012", "不支持该格式文档转换"),

	E_90001("90001", "OCR识别失败"),
	E_90002("90002", "图片转码失败"),
	E_90004("90004", "OCR文件格式不支持"),
	E_90005("90005", "OCR功能未开启");


	private final String errorCode;

	private final String errorMsg;

	ErrorEnum(String errorCode, String errorMsg) {
		this.errorCode = errorCode;
		this.errorMsg = errorMsg;
	}

	public String getErrorCode() {
		return errorCode;
	}

	public String getErrorMsg() {
		return errorMsg;
	}
}
